Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationDataToManagedConvertor
The Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationDataToNativeConvertor class provides a conversion method for converting a Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t value
to a Tekla.BIM.DirectManipulation.Services.Toleration.TolerationData instance.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationDataToManagedConvertor.Convert(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationSnapPoint_t)
Converts a Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationSnapPoint_t value to a Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedPoint value.
point: The Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationSnapPoint_t to convert.
Returns: The converted Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedPoint value.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationDataToManagedConvertor.GetTolerationData(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t,Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsViewInfo)
Gets the Tekla.BIM.DirectManipulation.Services.Toleration.TolerationData specified in the given Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t.
eventData: The event data to extract the Tekla.BIM.DirectManipulation.Services.Toleration.TolerationData from.
viewData: The view data associated with the tolerated objects.
Returns: The toleration data.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationDataToManagedConvertor.Convert(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationObject_t[],System.Int32)
Converts an array of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationObject_t to a list of Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedObject.
toleratedObjects: The tolerated objects to convert.
count: The number of items to convert.
Returns: The converted tolerated objects.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationDataToManagedConvertor.Convert(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationObject_t)
Converts an instance of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationObject_t to Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedObject.
toleratedObject: The tolerated object to convert.
Returns: The converted tolerated objects.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationDataToManagedConvertor.GetCustomObjectType(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationObject_t)
Gets the type of the custom object.
toleratedObject: The tolerated object.
Returns: The type of the custom object.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationDataToManagedConvertor.Convert(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationSnapPoint_t[],System.Int32)
Converts an array of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationSnapPoint_t to an array of Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedPoint.
points: The snapped points to convert.
count: The number of items to convert.
Returns: The converted snapped points.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationDataToManagedConvertor.Convert(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationPointOnLine_t[],System.Int32,Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsViewInfo)
Converts an array of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationPointOnLine_t to a list of Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedLine.
toleratedLines: The tolerated lines to convert.
count: The number of items to convert.
viewData: The view data associated with the toleratedLines.
Returns: The converted tolerated lines.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationDataToManagedConvertor.Convert(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationPointOnFace_t[],System.Int32,Tekla.BIM.DirectManipulation.Services.Graphics.IGraphicsViewInfo)
Converts an array of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationPointOnFace_t to an array of Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedFace.
toleratedFaces: The tolerated faces to convert.
count: The number of items to convert.
viewData: The view data associated with the toleratedFaces.
Returns: The converted tolerated faces.

Tekla.Structures.DirectManipulation.Adapter.Interaction.TolerationDataToManagedConvertor.ToToleratedLine(Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedFace)
Gets the given Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedFace as a Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedLine instance.
Remarks:
Used for converting toleration data on Tekla.Structures.Model.Reinforcement instances, which are always wrongly tolerated as faces by TS core.
toleratedFace: The Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedFace to convert to a Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedLine instance.
Returns: The given Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedFace as a Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedLine instance.